[ feat ] : improve docs
